  import 'package:flutter/material.dart';

  class MyData_MoviesEgypt{
    String name;
    String description;
    String imagUrl;
    String videoUrl;

    MyData_MoviesEgypt.items({
      this.name,
      this.description,
      this.imagUrl,
      this.videoUrl,
  });

  }
  List<MyData_MoviesEgypt> dataMoviEgypt =[

    MyData_MoviesEgypt.items(
      name: "علي معزة",
      description: "يدور الفيلم حول (علي)، شاب في العشرين من عمره يحب معزة ويواجه انتقادات كثيرة وسخرية لاذعة من مجتمعه بسبب ذلك، فتُرغمه أمه على زيارة أحد المعالجين الروحانيين، حيث يلتقي هناك (إبراهيم) الذي يعاني من اكتئاب حاد ويسمع أصواتًا غامضة لا يستطيع فك رموزها.. ينطلق علي برفقة إبراهيم ومعزته في رحلة عبر (مصر) لمساعدة بعضهم في التغلب على محنتهم وإيجاد أملًا يدفعهما للتمسك بالحياة مرة أخرى",
      imagUrl: "https://maxcdn.dardarkom.tv/up/uploads/1533512271422.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "طلق صناعي 2018 ",
      description: "تدور أحداث الفيلم في إطار كوميدي حول زوجين يسعان للحصول على تأشيرة السفر إلى أمريكا، ويكتشف الزوج أن زوجته الحامل أخذت حبوب لتسريع عملية الولادة لتلد على أرض أمريكية، ويحصل ابنه على الجنسية.",
      imagUrl: "https://maxcdn.dardarkom.tv/up/uploads/1528934292213.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),

    MyData_MoviesEgypt.items(
      name: "فوتوكوبي2017",
      description: "محمود، في أواخر الخمسينيات من عمره، صاحب مكتبة لتصوير ونسخ المستندات فى حى عبده باشا، أحد أحياء الطبقة المتوسطة. يرى أن مهنته والعالم من حوله يتلاشى تدريجيًا ولا يقدر على التكيف معه أو مع جيرانه، وفي أحد الأيام أثناء تصويره للمستندات يجد موضوعًا عن الديناصورات ليبدأ رحلته من الهوس بالبحث عن أسباب انقراضها في إطار درامي، يدفعه هذا الهوس بالديناصورات إلى إعادة اكتشاف الحب والصداقة والأبوة والمعنى الحقيقي للحياة.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/152893366962.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "الخلية 2017 ",
      description: "تدور الاحداث حول ضابط عمليات خاصة اسمه (سيف)، يقوم بالتصدي لشخص إرهابي اسمه (مروان)، وأثناء هذه العملية يستشهد ضابط العمليات الخاصة (عمرو)، ويصاب (سيف) نتيجة إنفجار قنبلة بجانبه، فيقسم (سيف) على أن يعود مرة أخرى ليثأر لحق (عمرو)، إلا أن العمليات الخاصة ترفض رجوعه بسبب عدم شفائه، وعلى جانب آخر يعمل الضابط (صابر) على نفس ملف هذا الإرهابي، فيذهب",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1534927732411.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "إطلعولي بره 2018",
      description: "تدور أحداث الفيلم في إطار من الكوميديا حول شخص يعيش في حارة شعبية، يجد في أحد الأيام كتاب اسمه اطلعولي بره، يتحدث عن وجود شخصيات بداخل كل فرد، وعندما يقرأه هذا الشخص تخرج له عدد من الشخصيات تسيطر على مواقفه وحياته وقراراته.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1535085574351.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "شنطة حمزة 2017 ",
      description: "تدور احداث الفيلم حول (حمادة هلال) النصاب المحترف، الذي يقع في حب فتاة قوية الشخصية كانت تعمل هي الأخرى في إحدى العصابات المشهورة بالنصب، فما الذي سيحدث.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1535085657311.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "فص ملح وداخ 2016",
      description: "تدور أحداث الفيلم في إطار كوميدي حول لعنة تصيب أحد المسارح المهجورة، والذي من المفترض أن يؤول لبكري (عمرو عبدالجليل)، وحينما يكتشف أمر اللعنة، يحاول إبطال هذه اللعنة التي تحل عليه حينما يكون موجودًا في هذا المكان.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1538579103312.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),



    MyData_MoviesEgypt.items(
      name: "رغدة متوحشة 2018 ",
      description: "تدور احداث الفيلم حول الشاب إسماعيل الذي يعمل بأحد مراكز التجميل، وبالصدفة يكتشف أن أحد مخرجي الإعلانات يبحث عن وجه جديد، فيحول نفسه لفتاة من أجل تقديم الإعلان وبالفعل ينجح فى ذلك قبل أن ينكشف أمره ويتعرض للعديد من المواقف الكوميدية، مثل التحرش وغيرها من المعاناة التي تواجه المرأة في مجتمعنا.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1537591280683.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),

    MyData_MoviesEgypt.items(
      name: "عندما يقع اﻹنسان في مستنقع ",
      description: "يتوجه كل من هاني خبير التجميل وبيبو الجهادي المنضم حديثًا لجماعة إسلامية متطرفة وسمير تاجر المخدرات في رحلة إلى لبنان، وتتلاقي طرائق ثلاثتهم معًا، وبدون قصد ينتهي بهم الحال جميعًا في قبضة الجماعة المتطرفة التي انضم إليها بيبو، ويحاول ثلاثتهم إيجاد طريقة للافلات من قبضة زعيمها أبو عماد.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1537590250512.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "خير وبركة 2017 ",
      description: "تدور أحداث الفيلم في إطار كوميدى يتناول قصة شقيقين يحاولان البحث عن فرصة عمل، وخلال رحلة البحث يواجهان العديد من المواقف الكوميدية عندما يعملان في مهن لا يعرفان عنها شيئًا.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1537589512612.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "بنك الحظ 2017 ",
      description: "بعد فصل محمد صالح (محمد ممدوح) من البنك الذي يعمل به بسبب تجاوزاته المستمرة في حق العملاء، يقرر التحالف مع عمرو (أكرم حسني) زميله في البنك، وزئرو (محمد ثروت) شريكهما في محل ألعاب البلاي ستيشن في سبيل سرقة 15 مليون جنيه من البنك الذي كان صالح يعمل به.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1535084759381.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "سمكة وصنارة 2017",
      description: "تدور أحداث الفيلم في جو من المغامرة والكوميديا حول محمد حمص ومصطفي بنداري، وهما نصابان يقومان بعمليات نصب صغيرة علي الناس في الشوارع حتى تأتي في طريقهم عملية نصب كبيرة ويبدأ كلاهما في التخطيط والتجهيز لتنفيذ العملية مع بعضهم فتقع لهما أحداث لم تكن في الحسبان",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/154014268791.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: " فيلم ليلة هنا وسرور ",
      description: "تدور الأحداث حول النصاب المحترف رضا (محمد إمام)، الذي يعود من إيطاليا لسرقة تمثال أثري، وينتحل شخصية رجل أعمال يُدعى (سرور أبو الدهب)، ويتعرف على الفتاة هنا (ياسمين صبري) ويتزوج منها، ويوهمها بأنه يعمل لدى المخابرات المصرية، وأن الموساد يتعقبه لسرقة التمثال، في الوقت ذاته يتربص به زعيم العصابة الحاج الضو (فاروق الفيشاوي) ليسرق نفس التمثل.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/154369452393.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


    MyData_MoviesEgypt.items(
      name: "الكويسين 2018 ",
      description: "مفتاح وشقيقته غزال ثنائي متخصص في النصب، يكتشف مفتاح وجود جوهرة ثمينة تدعى القرموط القرمزي في منزل عائلة الكويسين، فيقرر اختراق صفوف هذه العائلة من خلال انتحال شخصية ابنهم مظهر المفقود منذ سنوات طويلة، لكن هذه المهمة تواجه الكثير من الصعوبات رغم نجاحها في البداية.",
      imagUrl: "http://maxcdn.dardarkom.com/up/uploads/1544999832721.jpg",
      videoUrl: "https://maxcdn.dardarkom"
    ),


  ];
